{"pageId":31774937,"revisions":[{"text":" \n\n\n  Lady Gaga's meat dress      Gaga wearing the meat dress at the  2010 MTV Video Music Awards  Designer  Franc Fernandez  Year 2010  Material Raw  flank steak  On display at  Rock and Roll Hall of Fame\n At the  2010 MTV Video Music Awards, American singer  Lady Gaga wore an infamous dress made of raw  beef, which was commonly referred to by the media as the  meat dress.  [1]  [2]  [3] Designed by  Franc Fernandez and styled by  Nicola Formichetti, the dress was condemned by animal rights groups, and named by   Time as the top fashion statement of 2010.\n The press speculated on the originality of the meat dress idea, with comparisons made to similar images found in contemporary art and popular culture. As with her other dresses, it was archived, but went on display in 2011 at the  Rock and Roll Hall of Fame after being preserved by  taxidermists as a type of  jerky. Gaga explained following the awards ceremony that the dress was a statement about one's need to fight for what one believes in, and highlighted her distaste for the US military's  don't-ask-don't-tell policy.\n\n    Contents  \n \n   1  Background\n   2  Design\n   3  Influence\n   4  Reception\n   5  References\n   6  Further reading\n\n\n\n  Background  [ edit ]\n Gaga was the most nominated artist at 2010's Video Music Awards with a record thirteen nominations, including two nods for  Video of the Year (the first female artist to achieve this feat).  [4] She arrived in an  Alexander McQueen dress and changed into a  Giorgio Armani number before donning her third and final outfit of the evening: a dress, hat, boots, and purse made of raw meat. Gaga wore the meat dress to accept her Video of the Year trophy for \" Bad Romance\"; as she accepted the award from presenter  Cher, she joked, \"I never thought I'd be asking Cher to hold my meat purse.\"  [5] Gaga continued to wear the dress after the awards show for press photos and an interview on   The Ellen DeGeneres Show.  [1] Gaga explained her interpretation of the dress to DeGeneres, stating, \"If we don’t stand up for what we believe in and if we don’t fight for our rights[,] pretty soon we’re going to have as much rights as the meat on our bones.\"  [6] \"Now, I love Lady Gaga, but as someone who also loves animals, it was really difficult for me to sit next to Lady Gaga while she was wearing that outfit,\" DeGeneres, who was  vegan, later wrote. \"But it did make me ask myself, what's the difference between her outfit and an outfit made of leather?\"  [6]\n\n  Design  [ edit ]\n         Gaga wearing a faux-meat dress during the  Born This Way Ball tour\n Fernandez was approached by fellow designer and stylist Formichetti to produce the dress, with it planned out over the course of a week,  [1] Formichetti having styled the look.  [7] The dress was asymmetrical, with a cowled–neck.  [8] Fernandez specifically chose cuts to ensure that the dress kept well.  [1]  Flank steak was chosen as the material to use,  [3] with the meat coming from his family  butcher.  [7] The dress required Gaga to be stitched into the outfit backstage.  [9]\n Fernandez said of his design, \"I knew the dress would be one of other amazing pieces Gaga wore that night. It's very well made and looked great on her, on and off camera. We didn't get a chance to have a fitting. The only time she had it on was for the VMAs. Only when I saw it in the monitor did I know it would be big.\"  [3]\n Fernandez reporting Gaga's opinion in an interview said that Gaga herself said it smelled good, because it smelled like meat.  [1] The designer talked of what was to happen to the dress after the awards show, \"The dress will be put in an archive with all of her dresses. The Gaga Archives, I suppose. It won't last, that's the beauty of it. When it is brought out again, hopefully it will be in a retrospective, and it will be a different dress, which is the best thing. I like the idea of it changing and evolving into something else\".  [1] He later explained that the dress would be preserved and made into a type of  jerky before being archived.  [10]\n The  Rock and Roll Hall of Fame paid $6,000 to taxidermist Sergio Vigilato to preserve the dress. It had been frozen following the two television appearances, although Vigilato discovered signs of decomposition on the dress which had occurred prior to it being frozen, and noted it was emitting an odor once it was defrosted. It was treated with bleach,  formaldehyde and detergent to kill any bacteria which had formed, and was reconditioned by being dyed dark red once it was preserved so to give it the same appearance as when first worn. However, after the preservation there were several pieces of beef left over and not included in the reworked dress.  [11]\n Gaga wore a faux-meat dress while performing the songs \" Americano\" and \" Poker Face\" during her  Born This Way Ball tour.  [12]\n\n  Influence  [ edit ]\n         The Rock and Roll Hall of Fame, where the meat dress went on display in 2011\n Previously, she had worn a bikini made of meat on the front cover of the Japanese edition of   Vogue.  [13] It was originally worn by Gaga at the  2010 MTV Video Music Awards to accept her award for  Video of the Year.  [7] Although it was Gaga's third costume change of the evening, the meat dress was immediately described as \"most outrageous fashion moment\" of the evening.  [7]\n Fernandez credits the dress with an upturn in his career, saying, \"I feel like I have a voice now as an artist and as a designer\".  [9] He had previously created items for Gaga, including a costume for her music video for \" Bad Romance\".  [14] He went on to create a hat that Gaga wore to the  53rd Grammy Awards in February 2011.  [9]\n The dress went on display at the  Rock and Roll Hall of Fame and Museum in 2011 as part of an exhibition entitled \"Women Who Rock: Vision, Passion, Power\".  [15]\n A poll by website MyCelebrityFashion.co.uk placed the dress as the most iconic outfit of 2010, beating  Kate Middleton's  engagement dress into second place.  [16] In summing up 2010 through a series of lists,   Time voted the meat dress as its top fashion statement of 2010.  [17]  [18]\n When  \"Weird Al\" Yankovic did a parody of Gaga's \" Born This Way\", titled \" Perform This Way\", he included a lyrical reference to the meat dress (\"I strap prime rib to my feet / Cover myself with raw meat / I'll bet you've never seen a skirt steak worn this way\") and had a dancer dressed in a similar outfit in the music video.  [19]\n\n  Reception  [ edit ]\n Following the VMAs, media outlets attempted to analyse the meaning of the dress with suggestions by  BBC News ranging from  anti-fashion, to  feminism, aging and decay, and society's attitude towards meat. Chef  Fergus Henderson explained this meat attitude as \"People often don't want meat to look like meat. They want it to be neatly wrapped in plastic from a supermarket.\"  [20]  People for the Ethical Treatment of Animals (PETA) condemned the dress, releasing a statement that said \"wearing a dress made from cuts of dead cows is offensive enough to bring comment, but someone should whisper in her ear that more people are upset by butchery than are impressed by it.\"  [21]  [22] The Vegetarian Society also condemned the dress, releasing a statement that said \"No matter how beautifully it is presented, flesh from a tortured animal is flesh from a tortured animal. Enough animals die for food and they should not be killed for stunts like this.\"  [23]\n Another controversy surrounding the dress was the question of its originality. Brooks Barnes of   The New York Times wrote that the dress was \"derived\" from  Incarnation, a painting of a white-haired girl wearing a meat dress by artist  Mark Ryden.  [24]  [25] Sharon Clott of MTV also noted the similarity between Gaga's dress and Ryden's painting.  [25] Ryden was reportedly upset that Gaga did not acknowledge that she took inspiration from his work.  [24] Some in the art and fashion press remarked on the dress' similarity to  Vanitas: Flesh Dress for an Albino Anorectic, a meat dress made by Canadian sculptor  Jana Sterbak in 1987 exhibited to considerable controversy at the  National Gallery of Canada in 1991.  [26]  [27]  [28] Karen Rosenberg from  The New York Times compared the dress to a series of photographs of  Francis Bacon posing with sides of beef attached to his torso like wings in 1952,  [29] while   The Daily Telegraph compared the dress to the original cover of  The Beatles' 1966 album   Yesterday and Today, and noted its similarity to the cover of  The Undertones' 1984 album  All Wrapped Up, which showed a female model wearing a dress and gloves made of cuts of meat (mostly bacon) held in place with plastic wrap and a sausage necklace.  [23]  [30] Architects  Diller Scofidio + Renfro had also designed a meat dress in 2006.  [2] An earlier example of a garment made from meat stitched together in the same way as the Lady Gaga meat dress was worn at the  Slade School of Art postgraduate degree exhibition opening in London, England in July 1979, when  performance artist Robert Connolly wore a two-piece suit made of slices of  salami.  [31]\n Some media sources proposed that the dress could be interpreted as anti- vegan.  [32] Vegetarian singer  Morrissey stated that he felt the dress was acceptable as long as it was a social or political statement, and not just a \"loony idea\",  [33] pointing out that artist  Linder Sterling had previously worn a meat dress in 1982 to protest against what she believed to be the perception of women by men.  [33]  Ellen DeGeneres presented Gaga with a  bikini made of vegetables when the singer appeared on her talk show, and the singer used the platform to respond to the controversy surrounding the dress saying, \"... it has many interpretations. For me this evening, if we don't stand up for what we believe in and if we don't fight for our rights pretty soon, we're going to have as much rights as the meat on our own bones. And, I am not a piece of meat.\"  [21] She explained further that she was also using the dress to highlight her distaste for the US military's \" don't ask, don't tell\" policy.  [34]\n\n  References  [ edit ]\n \n \n  ^     a     b     c     d     e     f   Vena, Jocelyn (September 16, 2010).  \"Lady Gaga Meat Dress Designer Tells How To Re-Create His VMA Look\".  MTV News.  Archived from the original on July 7, 2014 . Retrieved  May 14, 2011.  .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output .citation q{quotes:\"\"\"\"\"'\"\"'\"}.mw-parser-output .id-lock-free a,.mw-parser-output .citation .cs1-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .id-lock-limited a,.mw-parser-output .id-lock-registration a,.mw-parser-output .citation .cs1-lock-limited a,.mw-parser-output .citation .cs1-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .id-lock-subscription a,.mw-parser-output .citation .cs1-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/12px-Wikisource-logo.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-maint{display:none;color:#33aa33;margin-left:0.3em}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}\n\n  ^     a     b    \"Music Piracy: Lady Gaga Is To Blame\". Lovelyish.com. July 9, 2011. Archived from  the original on October 6, 2013 . Retrieved  February 25, 2012.  \n\n  ^     a     b     c   Padilla, Max (September 24, 2010).  \"Lady Gaga Meat Dress Designer's Lips Are Zipped About Animal Rights\".   The Huffington Post.  Archived from the original on September 9, 2011 . Retrieved  May 14, 2011.  \n\n    ^   Vena, Jocelyn (August 3, 2010).  \"Lady Gaga, Eminem Top VMA Nominations\". MTV News.  Archived from the original on May 5, 2014 . Retrieved  May 20, 2013.  \n\n    ^   Ganz, Caryn (September 12, 2010).  \"Meet the Mystery Meat Dress: Lady Gaga Explains Rare VMAs Outfit\".  Yahoo! Music. Archived from  the original on December 25, 2011 . Retrieved  May 20, 2013.  \n\n  ^     a     b    \"So about Lady Gaga's meat dress...\" CNN.com Blogs. September 14, 2010.  Archived from the original on November 2, 2014 . Retrieved  May 20, 2013.  \n\n  ^     a     b     c     d   Clott, Sharon (September 13, 2010).  \"Was Lady Gaga's VMA Meat Dress Real?\". MTV News.  Archived from the original on April 27, 2016 . Retrieved  May 14, 2011.  \n\n    ^   Topping, Alexandra (September 13, 2010).  \"Lady Gaga's meat dress angers animal rights groups\".   The Guardian.  Archived from the original on September 16, 2013 . Retrieved  May 14, 2011.  \n\n  ^     a     b     c   Vazquez, Anna (March 9, 2010).  \"Lady Gaga Meat Dress Designer Franc Fernandez Q&A\".  Stylelist.  AOL. Archived from  the original on September 10, 2011 . Retrieved  May 14, 2011.  \n\n    ^   Gornstein, Leslie (September 22, 2010).  \"Did anyone ever eat Lady Gaga's meat dress?\".  E!. Archived from  the original on March 25, 2012 . Retrieved  May 14, 2011.  \n\n    ^   Pool, Bob (July 22, 2011).  \"Taxidermist preserves Lady Gaga's meat dress for posterity\".   Los Angeles Times. Archived from  the original on July 26, 2011 . Retrieved  July 31, 2011.  \n\n    ^   Dumaual, Miguel (May 23, 2012).  \"Review: Lady Gaga's 'Born This Way Ball '\".  ABS-CBN.  Archived from the original on August 27, 2016 . Retrieved  June 9, 2012.  \n\n    ^   Cristina Everett (September 7, 2010).  \"In the flesh: Lady Gaga dons raw meat on cover of Vogue Hommes Japan\".  New York Daily News.  \n\n    ^   Franc Fernandez\n\n    ^   Mapes, Jill (May 13, 2011).  \"Women Who Rock' Exhibit Opens, Features Lady Gaga's Meat Dress\".   Billboard.  Archived from the original on March 11, 2013 . Retrieved  May 14, 2011.  \n\n    ^   Lee, Ann (December 16, 2010).  \"Lady Gaga's meat dress 'most iconic' of 2010\".   Metro. London.  Archived from the original on October 4, 2013 . Retrieved  May 14, 2011.  \n\n    ^    \"The Top 10 Everything of 2010\".   Time.  Archived from the original on August 20, 2016 . Retrieved  May 14, 2011.  \n\n    ^    \"Lady Gaga's meat dress 'No. 1' fashion statement of 2010\".   The Independent. London. December 17, 2010. Archived from  the original on December 20, 2010 . Retrieved  May 14, 2011.  \n\n    ^    \"Weird Al Yankovic lampoons Lady Gaga in 'Perform This Way '\".  CBS News. June 21, 2011. Archived from  the original on June 23, 2011 . Retrieved  June 21, 2011.  \n\n    ^   Winterman, Denise; Kelly, Jon (September 14, 2010).  \"Five interpretations of Lady Gaga's meat dress\".  BBC News.  BBC.  Archived from the original on September 15, 2010 . Retrieved  May 14, 2011.  \n\n  ^     a     b   Roberts, Laura (September 14, 2010).  \"Lady Gaga's meat dress divides opinion\".   The Daily Telegraph.  Archived from the original on September 14, 2010 . Retrieved  May 14, 2011.  \n\n    ^   Newkirk, Ingrid E. (September 13, 2010).  \"Lady Gaga's Meat Dress\".  PETA.  Archived from the original on July 24, 2016 . Retrieved  September 13, 2010.  \n\n  ^     a     b   Bloxham, Andy (September 15, 2010).  \"Lady Gaga's meat dress link to the Beatles\".  The Daily Telegraph. London.  Archived from the original on February 4, 2011 . Retrieved  July 31, 2011.  \n\n  ^     a     b   Barnes, Brooks (May 16, 2014).  \"Mark Ryden: Drawing a Dividing Line\".   The New York Times.  Archived from the original on March 17, 2016 . Retrieved  April 6, 2016.  \n\n  ^     a     b   Clott, Sharon (September 13, 2010).  \"Does Lady Gaga's Meat Dress Remind You Of Mark Ryden's Paintings?\". MTV News.  Archived from the original on April 15, 2016 . Retrieved  April 6, 2016.  \n\n    ^   Knight, Christopher (September 13, 2010).  \"Lady Gaga, meat Jana Sterbak\".  Los Angeles Times.  Archived from the original on August 20, 2016 . Retrieved  September 16, 2016.  \n\n    ^   Gayford, Martin (September 17, 2010).  \"Lady Gaga's Fleshy Outfit Echoes Artistic Lobsters, Maggots\".  Bloomberg News.  Archived from the original on September 17, 2016 . Retrieved  September 16, 2016.  \n\n    ^   Seashore, Ashley (September 13, 2010).  \"Lady Gaga's Meat Dress and the Question of Authenticity\".  TheGloss. Archived from  the original on December 2, 2010 . Retrieved  September 16, 2016.  \n\n    ^   Rosenberg, Karen (May 12, 2011).  \"Two Meaty Visions of Flesh and Blood\".  The New York Times.  Archived from the original on May 16, 2011 . Retrieved  May 14, 2011.  \n\n    ^   Heard, Chris (November 15, 2013).  \"Dressed to grill: From The Undertones to Lady Gaga\". BBC News.  Archived from the original on March 15, 2016 . Retrieved  September 16, 2016.  \n\n    ^    \"Letters: Salami style\".  The Guardian. September 20, 2010.  Archived from the original on September 27, 2016 . Retrieved  September 16, 2016.  \n\n    ^   Walker, Alissa (September 13, 2010).  \"Is Lady Gaga's Meat Couture an Anti-Vegan Statement?\".   Good.  Archived from the original on September 17, 2016 . Retrieved  September 16, 2016.  \n\n  ^     a     b   Deacon, Michael (June 17, 2011).  \"Morrissey on... Lady Gaga and modern pop\".   The Daily Telegraph.  Archived from the original on June 20, 2011 . Retrieved  June 28, 2011.  \n\n    ^   Kaufman, Gil (September 13, 2010).  \"Lady Gaga Talks VMA Meat Suit With Ellen DeGeneres\". MTV News.  Archived from the original on November 2, 2014 . Retrieved  November 28, 2011.  \n\n\n  Further reading  [ edit ]\n \n  \n  \n Wikimedia Commons has media related to     Lady Gaga's meat dress.\n\n   Smith, Heather (March 2011).  \"Behind the Meat Dress: There are people sewing the meat dress\".   Meatpaper (14).  Archived from the original on March 11, 2011 . Retrieved  September 16, 2016.  \n          v   t   e  Lady Gaga   \n   Awards and nominations\n  Discography\n  Live performances\n  Songs\n  Videography\n  Studio albums  \n    The Fame\n   The Fame Monster\n   Born This Way\n   Artpop\n   Joanne\n  Collaborative albums  \n    Cheek to Cheek\n  Soundtracks  \n    A Star Is Born\n  Compilations  \n    The Remix\n   Born This Way: The Remix\n   Born This Way: The Collection\n  Extended plays  \n    The Cherrytree Sessions\n   Hitmixes\n   A Very Gaga Holiday\n  Concert tours  \n   The Fame Ball Tour\n  Fame Kills: Starring Kanye West and Lady Gaga\n  The Monster Ball Tour\n  Born This Way Ball\n  ArtRave: The Artpop Ball\n  Cheek to Cheek Tour\n  Joanne World Tour\n  One-off shows  \n   ArtRave\n  Dive Bar Tour\n  Residencies  \n   Lady Gaga Live at Roseland Ballroom\n  Lady Gaga Enigma\n  Documentaries  \n    Gaga: Five Foot Two\n  Television  \n    Lady Gaga Presents the Monster Ball Tour: At Madison Square Garden\n   A Very Gaga Thanksgiving\n   Lady Gaga and the Muppets Holiday Spectacular\n   Tony Bennett and Lady Gaga: Cheek to Cheek Live!\n  Super Bowl LI halftime show\n  Fragrances  \n   Lady Gaga Fame\n  Eau de Gaga\n  Bibliography  \n    Lady Gaga x Terry Richardson\n  Related articles  \n    Aleiodes gaga\n  Born This Way Foundation\n  Doll Domination Tour\n   Gaga (plant)\n   Gagadon\n  Haus of Gaga\n   Lady Gaga: Queen of Pop\n \" Lisa Goes Gaga\"\n \" Maybe It's Time\"\n  Meat dress\n \" Perform This Way\"\n   A Star Is Born\n  TechHaus Volantis\n   \n     Book\n    Category\n\n          v   t   e  Red carpet fashion  Dates  \n   2000\n  2001\n  2002\n  2003\n  2004\n  2005\n  2006\n  2007\n  2008\n  2009\n  2010\n  2011\n  2012\n  2013\n  2014\n  2015\n  Individual outfits  \n  1954:  White floral Givenchy dress of Audrey Hepburn\n 1991:  Red Versace dress of Cindy Crawford\n 1994:  Black Versace dress of Elizabeth Hurley\n 1995:  Lavender Prada dress of Uma Thurman\n  American Express Gold card dress of Lizzy Gardiner\n 1999:  Pink Ralph Lauren dress of Gwyneth Paltrow\n 2000:  Green Versace dress of Jennifer Lopez\n 2001:  Black and white Valentino dress of Julia Roberts\n  Swan dress of Björk\n 2010:  Meat dress of Lady Gaga\n\n\n\n\n\n","revisionId":941941295,"userId":37890503},{"text":" \n\n\n  Lady Gaga's meat dress      Gaga wearing the meat dress at the  2010 MTV Video Music Awards  Designer  Franc Fernandez  Year 2010  Material Raw  flank steak  On display at  Rock and Roll Hall of Fame\n At the  2010 MTV Video Music Awards, American singer  Lady Gaga wore an infamous dress made of raw  beef, which was commonly referred to by the media as the  meat dress.  [1]  [2]  [3] Designed by  Franc Fernandez and styled by  Nicola Formichetti, the dress was condemned by animal rights groups, and named by   Time as the top fashion statement of 2010.\n The press speculated on the originality of the meat dress idea, with comparisons made to similar images found in contemporary art and popular culture. As with her other dresses, it was archived, but went on display in 2011 at the  Rock and Roll Hall of Fame after being preserved by  taxidermists as a type of  jerky. Gaga explained following the awards ceremony that the dress was a statement about one's need to fight for what one believes in, and highlighted her distaste for the US military's  don't-ask-don't-tell policy.\n\n    Contents  \n \n   1  Background\n   2  Design\n   3  Influence\n   4  Reception\n   5  References\n   6  Further reading\n\n\n\n  Background  [ edit ]\n Gaga was the most nominated artist at 2010's Video Music Awards with a record thirteen nominations, including two nods for  Video of the Year (the first female artist to achieve this feat).  [4] She arrived in an  Alexander McQueen dress and changed into a  Giorgio Armani number before donning her third and final outfit of the evening: a dress, hat, boots, and purse made of raw meat. Gaga wore the meat dress to accept her Video of the Year trophy for \" Bad Romance\"; as she accepted the award from presenter  Cher, she joked, \"I never thought I'd be asking Cher to hold my meat purse.\"  [5] Gaga continued to wear the dress after the awards show for press photos and an interview on   The Ellen DeGeneres Show.  [1] Gaga explained her interpretation of the dress to DeGeneres, stating, \"If we don’t stand up for what we believe in and if we don’t fight for our rights[,] pretty soon we’re going to have as much rights as the meat on our bones.\"  [6] \"Now, I love Lady Gaga, but as someone who also loves animals, it was really difficult for me to sit next to Lady Gaga while she was wearing that outfit,\" DeGeneres, who was  vegan, later wrote. \"But it did make me ask myself, what's the difference between her outfit and an outfit made of leather?\"  [6]\n\n  Design  [ edit ]\n         Gaga wearing a faux-meat dress during the  Born This Way Ball tour\n Fernandez was approached by fellow designer and stylist Formichetti to produce the dress, with it planned out over the course of a week,  [1] Formichetti having styled the look.  [7] The dress was asymmetrical, with a cowled–neck.  [8] Fernandez specifically chose cuts to ensure that the dress kept well.  [1]  Flank steak was chosen as the material to use,  [3] with the meat coming from his family  butcher.  [7] The dress required Gaga to be stitched into the outfit backstage.  [9]\n Fernandez said of his design, \"I knew the dress would be one of other amazing pieces Gaga wore that night. It's very well made and looked great on her, on and off camera. We didn't get a chance to have a fitting. The only time she had it on was for the VMAs. Only when I saw it in the monitor did I know it would be big.\"  [3]\n Fernandez reporting Gaga's opinion in an interview said that Gaga herself said it smelled good, because it smelled like meat.  [1] The designer talked of what was to happen to the dress after the awards show, \"The dress will be put in an archive with all of her dresses. The Gaga Archives, I suppose. It won't last, that's the beauty of it. When it is brought out again, hopefully it will be in a retrospective, and it will be a different dress, which is the best thing. I like the idea of it changing and evolving into something else\".  [1] He later explained that the dress would be preserved and made into a type of  jerky before being archived.  [10]\n The  Rock and Roll Hall of Fame paid $6,000 to taxidermist Sergio Vigilato to preserve the dress. It had been frozen following the two television appearances, although Vigilato discovered signs of decomposition on the dress which had occurred prior to it being frozen, and noted it was emitting an odor once it was defrosted. It was treated with bleach,  formaldehyde and detergent to kill any bacteria which had formed, and was reconditioned by being dyed dark red once it was preserved so to give it the same appearance as when first worn. However, after the preservation there were several pieces of beef left over and not included in the reworked dress.  [11]\n Gaga wore a faux-meat dress while performing the songs \" Americano\" and \" Poker Face\" during her  Born This Way Ball tour.  [12]\n\n  Influence  [ edit ]\n         The Rock and Roll Hall of Fame, where the meat dress went on display in 2011\n Previously, she had worn a bikini made of meat on the front cover of the Japanese edition of   Vogue.  [13] It was originally worn by Gaga at the  2010 MTV Video Music Awards to accept her award for  Video of the Year.  [7] Although it was Gaga's third costume change of the evening, the meat dress was immediately described as \"most outrageous fashion moment\" of the evening.  [7]\n Fernandez credits the dress with an upturn in his career, saying, \"I feel like I have a voice now as an artist and as a designer\".  [9] He had previously created items for Gaga, including a costume for her music video for \" Bad Romance\".  [14] He went on to create a hat that Gaga wore to the  53rd Grammy Awards in February 2011.  [9]\n The dress went on display at the  Rock and Roll Hall of Fame and Museum in 2011 as part of an exhibition entitled \"Women Who Rock: Vision, Passion, Power\".  [15]\n A poll by website MyCelebrityFashion.co.uk placed the dress as the most iconic outfit of 2010, beating  Kate Middleton's  engagement dress into second place.  [16] In summing up 2010 through a series of lists,   Time voted the meat dress as its top fashion statement of 2010.  [17]  [18]\n When  \"Weird Al\" Yankovic did a parody of Gaga's \" Born This Way\", titled \" Perform This Way\", he included a lyrical reference to the meat dress (\"I strap prime rib to my feet / Cover myself with raw meat / I'll bet you've never seen a skirt steak worn this way\") and had a dancer dressed in a similar outfit in the music video.  [19]\n\n  Reception  [ edit ]\n Following the VMAs, media outlets attempted to analyse the meaning of the dress with suggestions by  BBC News ranging from  anti-fashion, to  feminism, aging and decay, and society's attitude towards meat. Chef  Fergus Henderson explained this meat attitude as \"People often don't want meat to look like meat. They want it to be neatly wrapped in plastic from a supermarket.\"  [20]  People for the Ethical Treatment of Animals (PETA) condemned the dress, releasing a statement that said \"wearing a dress made from cuts of dead cows is offensive enough to bring comment, but someone should whisper in her ear that more people are upset by butchery than are impressed by it.\"  [21]  [22] The Vegetarian Society also condemned the dress, releasing a statement that said \"No matter how beautifully it is presented, flesh from a tortured animal is flesh from a tortured animal. Enough animals die for food and they should not be killed for stunts like this.\"  [23]\n Another controversy surrounding the dress was the question of its originality. Brooks Barnes of   The New York Times wrote that the dress was \"derived\" from  Incarnation, a painting of a white-haired girl wearing a meat dress by artist  Mark Ryden.  [24]  [25] Sharon Clott of MTV also noted the similarity between Gaga's dress and Ryden's painting.  [25] Ryden was reportedly upset that Gaga did not acknowledge that she took inspiration from his work.  [24] Some in the art and fashion press remarked on the dress' similarity to  Vanitas: Flesh Dress for an Albino Anorectic, a meat dress made by Canadian sculptor  Jana Sterbak in 1987 exhibited to considerable controversy at the  National Gallery of Canada in 1991.  [26]  [27]  [28] Karen Rosenberg from  The New York Times compared the dress to a series of photographs of  Francis Bacon posing with sides of beef attached to his torso like wings in 1952,  [29] while   The Daily Telegraph compared the dress to the original cover of  The Beatles' 1966 album   Yesterday and Today, and noted its similarity to the cover of  The Undertones' 1984 album  All Wrapped Up, which showed a female model wearing a dress and gloves made of cuts of meat (mostly bacon) held in place with plastic wrap and a sausage necklace.  [23]  [30] Architects  Diller Scofidio + Renfro had also designed a meat dress in 2006.  [2] An earlier example of a garment made from meat stitched together in the same way as the Lady Gaga meat dress was worn at the  Slade School of Art postgraduate degree exhibition opening in London, England in July 1979, when  performance artist Robert Connolly wore a two-piece suit made of slices of  salami.  [31]\n Some media sources proposed that the dress could be interpreted as anti- vegan.  [32] Vegetarian singer  Morrissey stated that he felt the dress was acceptable as long as it was a social or political statement, and not just a \"loony idea\",  [33] pointing out that artist  Linder Sterling had previously worn a meat dress in 1982 to protest against what she believed to be the perception of women by men.  [33]  Ellen DeGeneres presented Gaga with a  bikini made of vegetables when the singer appeared on her talk show, and the singer used the platform to respond to the controversy surrounding the dress saying, \"... it has many interpretations. For me this evening, if we don't stand up for what we believe in and if we don't fight for our rights pretty soon, we're going to have as much rights as the meat on our own bones. And, I am not a piece of meat.\"  [21] She explained further that she was also using the dress to highlight her distaste for the US military's \" don't ask, don't tell\" policy.  [34]\n\n  References  [ edit ]\n \n \n  ^     a     b     c     d     e     f   Vena, Jocelyn (September 16, 2010).  \"Lady Gaga Meat Dress Designer Tells How To Re-Create His VMA Look\".  MTV News.  Archived from the original on July 7, 2014 . Retrieved  May 14, 2011.  .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output .citation q{quotes:\"\"\"\"\"'\"\"'\"}.mw-parser-output .id-lock-free a,.mw-parser-output .citation .cs1-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .id-lock-limited a,.mw-parser-output .id-lock-registration a,.mw-parser-output .citation .cs1-lock-limited a,.mw-parser-output .citation .cs1-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .id-lock-subscription a,.mw-parser-output .citation .cs1-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/12px-Wikisource-logo.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-maint{display:none;color:#33aa33;margin-left:0.3em}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}\n\n  ^     a     b    \"Music Piracy: Lady Gaga Is To Blame\". Lovelyish.com. July 9, 2011. Archived from  the original on October 6, 2013 . Retrieved  February 25, 2012.  \n\n  ^     a     b     c   Padilla, Max (September 24, 2010).  \"Lady Gaga Meat Dress Designer's Lips Are Zipped About Animal Rights\".   The Huffington Post.  Archived from the original on September 9, 2011 . Retrieved  May 14, 2011.  \n\n    ^   Vena, Jocelyn (August 3, 2010).  \"Lady Gaga, Eminem Top VMA Nominations\". MTV News.  Archived from the original on May 5, 2014 . Retrieved  May 20, 2013.  \n\n    ^   Ganz, Caryn (September 12, 2010).  \"Meet the Mystery Meat Dress: Lady Gaga Explains Rare VMAs Outfit\".  Yahoo! Music. Archived from  the original on December 25, 2011 . Retrieved  May 20, 2013.  \n\n  ^     a     b    \"So about Lady Gaga's meat dress...\" CNN.com Blogs. September 14, 2010.  Archived from the original on November 2, 2014 . Retrieved  May 20, 2013.  \n\n  ^     a     b     c     d   Clott, Sharon (September 13, 2010).  \"Was Lady Gaga's VMA Meat Dress Real?\". MTV News.  Archived from the original on April 27, 2016 . Retrieved  May 14, 2011.  \n\n    ^   Topping, Alexandra (September 13, 2010).  \"Lady Gaga's meat dress angers animal rights groups\".   The Guardian.  Archived from the original on September 16, 2013 . Retrieved  May 14, 2011.  \n\n  ^     a     b     c   Vazquez, Anna (March 9, 2010).  \"Lady Gaga Meat Dress Designer Franc Fernandez Q&A\".  Stylelist.  AOL. Archived from  the original on September 10, 2011 . Retrieved  May 14, 2011.  \n\n    ^   Gornstein, Leslie (September 22, 2010).  \"Did anyone ever eat Lady Gaga's meat dress?\".  E!. Archived from  the original on March 25, 2012 . Retrieved  May 14, 2011.  \n\n    ^   Pool, Bob (July 22, 2011).  \"Taxidermist preserves Lady Gaga's meat dress for posterity\".   Los Angeles Times. Archived from  the original on July 26, 2011 . Retrieved  July 31, 2011.  \n\n    ^   Dumaual, Miguel (May 23, 2012).  \"Review: Lady Gaga's 'Born This Way Ball '\".  ABS-CBN.  Archived from the original on August 27, 2016 . Retrieved  June 9, 2012.  \n\n    ^   Cristina Everett (September 7, 2010).  \"In the flesh: Lady Gaga dons raw meat on cover of Vogue Hommes Japan\".  New York Daily News.  \n\n    ^   Franc Fernandez\n\n    ^   Mapes, Jill (May 13, 2011).  \"Women Who Rock' Exhibit Opens, Features Lady Gaga's Meat Dress\".   Billboard.  Archived from the original on March 11, 2013 . Retrieved  May 14, 2011.  \n\n    ^   Lee, Ann (December 16, 2010).  \"Lady Gaga's meat dress 'most iconic' of 2010\".   Metro. London.  Archived from the original on October 4, 2013 . Retrieved  May 14, 2011.  \n\n    ^    \"The Top 10 Everything of 2010\".   Time.  Archived from the original on August 20, 2016 . Retrieved  May 14, 2011.  \n\n    ^    \"Lady Gaga's meat dress 'No. 1' fashion statement of 2010\".   The Independent. London. December 17, 2010. Archived from  the original on December 20, 2010 . Retrieved  May 14, 2011.  \n\n    ^    \"Weird Al Yankovic lampoons Lady Gaga in 'Perform This Way '\".  CBS News. June 21, 2011. Archived from  the original on June 23, 2011 . Retrieved  June 21, 2011.  \n\n    ^   Winterman, Denise; Kelly, Jon (September 14, 2010).  \"Five interpretations of Lady Gaga's meat dress\".  BBC News.  BBC.  Archived from the original on September 15, 2010 . Retrieved  May 14, 2011.  \n\n  ^     a     b   Roberts, Laura (September 14, 2010).  \"Lady Gaga's meat dress divides opinion\".   The Daily Telegraph.  Archived from the original on September 14, 2010 . Retrieved  May 14, 2011.  \n\n    ^   Newkirk, Ingrid E. (September 13, 2010).  \"Lady Gaga's Meat Dress\".  PETA.  Archived from the original on July 24, 2016 . Retrieved  September 13, 2010.  \n\n  ^     a     b   Bloxham, Andy (September 15, 2010).  \"Lady Gaga's meat dress link to the Beatles\".  The Daily Telegraph. London.  Archived from the original on February 4, 2011 . Retrieved  July 31, 2011.  \n\n  ^     a     b   Barnes, Brooks (May 16, 2014).  \"Mark Ryden: Drawing a Dividing Line\".   The New York Times.  Archived from the original on March 17, 2016 . Retrieved  April 6, 2016.  \n\n  ^     a     b   Clott, Sharon (September 13, 2010).  \"Does Lady Gaga's Meat Dress Remind You Of Mark Ryden's Paintings?\". MTV News.  Archived from the original on April 15, 2016 . Retrieved  April 6, 2016.  \n\n    ^   Knight, Christopher (September 13, 2010).  \"Lady Gaga, meat Jana Sterbak\".  Los Angeles Times.  Archived from the original on August 20, 2016 . Retrieved  September 16, 2016.  \n\n    ^   Gayford, Martin (September 17, 2010).  \"Lady Gaga's Fleshy Outfit Echoes Artistic Lobsters, Maggots\".  Bloomberg News.  Archived from the original on September 17, 2016 . Retrieved  September 16, 2016.  \n\n    ^   Seashore, Ashley (September 13, 2010).  \"Lady Gaga's Meat Dress and the Question of Authenticity\".  TheGloss. Archived from  the original on December 2, 2010 . Retrieved  September 16, 2016.  \n\n    ^   Rosenberg, Karen (May 12, 2011).  \"Two Meaty Visions of Flesh and Blood\".  The New York Times.  Archived from the original on May 16, 2011 . Retrieved  May 14, 2011.  \n\n    ^   Heard, Chris (November 15, 2013).  \"Dressed to grill: From The Undertones to Lady Gaga\". BBC News.  Archived from the original on March 15, 2016 . Retrieved  September 16, 2016.  \n\n    ^    \"Letters: Salami style\".  The Guardian. September 20, 2010.  Archived from the original on September 27, 2016 . Retrieved  September 16, 2016.  \n\n    ^   Walker, Alissa (September 13, 2010).  \"Is Lady Gaga's Meat Couture an Anti-Vegan Statement?\".   Good.  Archived from the original on September 17, 2016 . Retrieved  September 16, 2016.  \n\n  ^     a     b   Deacon, Michael (June 17, 2011).  \"Morrissey on... Lady Gaga and modern pop\".   The Daily Telegraph.  Archived from the original on June 20, 2011 . Retrieved  June 28, 2011.  \n\n    ^   Kaufman, Gil (September 13, 2010).  \"Lady Gaga Talks VMA Meat Suit With Ellen DeGeneres\". MTV News.  Archived from the original on November 2, 2014 . Retrieved  November 28, 2011.  \n\n\n  Further reading  [ edit ]\n \n  \n  \n Wikimedia Commons has media related to     Lady Gaga's meat dress.\n\n   Smith, Heather (March 2011).  \"Behind the Meat Dress: There are people sewing the meat dress\".   Meatpaper (14).  Archived from the original on March 11, 2011 . Retrieved  September 16, 2016.  \n          v   t   e  Lady Gaga   \n   Awards and nominations\n  Discography\n  Live performances\n  Songs\n  Videography\n  Studio albums  \n    The Fame\n   The Fame Monster\n   Born This Way\n   Artpop\n   Joanne\n  Collaborative albums  \n    Cheek to Cheek\n  Soundtracks  \n    A Star Is Born\n  Compilations  \n    The Remix\n   Born This Way: The Remix\n   Born This Way: The Collection\n  Extended plays  \n    The Cherrytree Sessions\n   Hitmixes\n   A Very Gaga Holiday\n  Concert tours  \n   The Fame Ball Tour\n  Fame Kills: Starring Kanye West and Lady Gaga\n  The Monster Ball Tour\n  Born This Way Ball\n  ArtRave: The Artpop Ball\n  Cheek to Cheek Tour\n  Joanne World Tour\n  One-off shows  \n   ArtRave\n  Dive Bar Tour\n  Residencies  \n   Lady Gaga Live at Roseland Ballroom\n  Lady Gaga Enigma\n  Documentaries  \n    Gaga: Five Foot Two\n  Television  \n    Lady Gaga Presents the Monster Ball Tour: At Madison Square Garden\n   A Very Gaga Thanksgiving\n   Lady Gaga and the Muppets Holiday Spectacular\n   Tony Bennett and Lady Gaga: Cheek to Cheek Live!\n  Super Bowl LI halftime show\n  Fragrances  \n   Lady Gaga Fame\n  Eau de Gaga\n  Bibliography  \n    Lady Gaga x Terry Richardson\n  Related articles  \n    Aleiodes gaga\n  Born This Way Foundation\n  Doll Domination Tour\n   Gaga (plant)\n   Gagadon\n  Haus of Gaga\n   Lady Gaga: Queen of Pop\n \" Lisa Goes Gaga\"\n \" Maybe It's Time\"\n  Meat dress\n \" Perform This Way\"\n   A Star Is Born\n  TechHaus Volantis\n   \n     Book\n    Category\n\n          v   t   e  Red carpet fashion  Dates  \n   2000\n  2001\n  2002\n  2003\n  2004\n  2005\n  2006\n  2007\n  2008\n  2009\n  2010\n  2011\n  2012\n  2013\n  2014\n  2015\n  Individual outfits  \n  1954:  White floral Givenchy dress of Audrey Hepburn\n 1991:  Red Versace dress of Cindy Crawford\n 1994:  Black Versace dress of Elizabeth Hurley\n 1995:  Lavender Prada dress of Uma Thurman\n  American Express Gold card dress of Lizzy Gardiner\n 1999:  Pink Ralph Lauren dress of Gwyneth Paltrow\n 2000:  Green Versace dress of Jennifer Lopez\n 2001:  Black and white Valentino dress of Julia Roberts\n  Swan dress of Björk\n 2010:  Meat dress of Lady Gaga\n\n\n\n","revisionId":941817554,"userId":35936988}],"size":2}